Feature: Управление парковкой

  Scenario: Бронирование свободного парковочного места
    Given парковочное место 1 свободно
    When бронирую парковочное место 1
    Then место 1 становится занятым

  Scenario: Попытка повторного бронирования
    Given парковочное место 1 уже занято
    When пытаюсь забронировать парковочное место 1
    Then бронирование места 1 отклоняется

  Scenario: Освобождение парковочного места
    Given парковочное место 1 занято
    When освобождаю парковочное место 1
    Then место 1 становится свободным
